
### Задача 1

```Java
Напиши программу, которая выводит на экран надпись: "Амиго очень умный".

package com.javarush.task.task01.task0142;

/* 
Амиго очень умный
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Амиго очень умный");
    }
}

```


### Задача 2

```Java
Напиши программу, которая выводит на экран надпись:
`Я думаю, быть программистом круто`

package com.javarush.task.task01.task0101;

/* 
Я думаю, быть программистом круто
*/

public class Solution {
    public static void main(String[] args) {
        System.out.print("Я думаю, быть программистом круто");
    }
}

```

### Задача 3

```Java
Напиши программу, которая в методе main объявляет такие переменные:  
name типа String, age типа int и city типа String.
package com.javarush.task.task01.task0105;

/* 
Объявляем переменные
*/

public class Solution {
    public static void main(String[] args) {
        String name;
        int age;
        String city;
    }
}

```

### Задача 4

```Java
Объяви переменные a, b типа int.  
Сразу же в строке объявления присвой им разные значения.  
Значениями могут быть любые целые числа.

package com.javarush.task.task01.task0109;

/* 
«Я по объявлению…»
*/

public class Solution {
    public static void main(String[] args) {
        int a = 1;
        int b = 2;
    }
}

```

###  Задача 5

```Java
Сейчас 3126 год. Мой друг родился 8 лет назад.  
Написать программу, выводящую на экран год рождения моего друга.
package com.javarush.task.task01.task0103;

/* 
Мой юный друг
*/

public class Solution {
    public static void main(String[] args) {
        int birthYear = 3126 - 8;
        System.out.println(birthYear);
    }
}
```

### Задача 6 

```Java
Убери комментарии с части кода, чтобы на экран вывелось сообщение "_**Happy New Year**_".

package com.javarush.task.task01.task0115;

/* 
Ну это… С новым годом!
*/

public class Solution {
    public static void main(String[] args) {
        // String s = "Merry";
        // System.out.println("Christmas");
        // System.out.println("Merry New");
        // System.out.println("weekend");
        System.out.print("Happy New");
        // System.out.println("weekend");
        // System.out.println(s);
        // System.out.print("Merry New!");
        System.out.print(" ");
        System.out.println("Year");
    }
}

```

### Задача 7

```Java
Раскомментируй одну строчку, чтобы программа вывела на экран числа **12** и **2** (сначала 12, а затем 2).

package com.javarush.task.task01.task0107;

/* 
Комментарии излишни
*/

public class Solution {
    public static void main(String[] args) {
        int x = 2;
        int y = 12;

        // y = x * y;
        y = x + y;

        x = y - x;
        y = y - x;

        System.out.println(x);
        System.out.println(y);
    }
}

```

### Задача 8 

```Java
**Закомментируй ненужные строки кода, чтобы на экран вывелась надпись:**  
`2 плюс 3 равно 5`

package com.javarush.task.task01.task0108;

/* 
2 + 3 = 5
*/

public class Solution {
    public static void main(String[] args) {
        int a = 3;
        int b = 2;

       // System.out.print("два");
        System.out.print(b);
        System.out.print(" плюс ");
        //System.out.print(" минус ");
        System.out.print(a);
        //System.out.print("три");
        System.out.print(" равно ");
        //System.out.print(" будет ");
        //System.out.print("пять");
        System.out.print(a + b);
    }
}


```








