Перегрузка означает, что один и тот же метод может вести себя по-разному с разными аргументами.

Например, в классе `ArrayList` есть метод `add()`. Он добавляет элемент.

Этот метод может работать по-разному: поставить элемент в конец списка или на определённую позицию.

То, как будет работать метод, зависит от аргумента в скобках.

Если в скобках указать только элемент, метод поставит его в конец списка:

Скопировать кодJAVA

```

public class ArrayList implements List {
        
    public boolean add(E e) { // аргумент — только элемент типа E
        // добавляет элемент в конец списка
    }
} 
```

Если в скобках указать индекс, элемент попадёт на определённую позицию:

Скопировать кодJAVA

```

public class ArrayList implements List {
        
    public void add(int index, E element) { // два аргумента: позиция типа int и элемент типа Е
        // вставляет элемент на указанную позицию в список
    }
} 
```

Получается, методы называются одинаково, а работают по-разному с разными аргументами. Это и называется перегрузкой.

Перегрузка делает классы удобнее. Она покрывает частые случаи: не нужно писать отдельные методы.

Представь, что метод `add()` есть только один: он вставляет элемент на определённую позицию. Если нужно поставить элемент в конец списка, придётся писать длинную команду — `list.add(list.size(), element);`.

Добавлять элемент в конец списка нужно часто. Поэтому легче сделать это перегрузкой.

Это последний урок в теме про полиморфизм. Вспомни, что удалось узнать:

1. **Полиморфизм** означает, что у методов с одним названием могут быть разные реализации.
2. Проявления полиморфизма — переопределение и перегрузка.
3. **Переопределение** методов означает, что один и тот же метод может вести себя по-разному в классах-наследниках. Например, метод `eat()` — «жевать листья» для жирафа и «есть корм» для кошки.
4. **Перегрузка** означает, что метод ведёт себя по-разному в зависимости от аргументов. Например, `add()` ставит элемент в конец списка или на определённое место.
5. Все классы подчиняются полиморфизму, потому что у них есть общий предок `Object()`.

### Забери с собой

Всё о полиморфизме — в [шпаргалке](https://code.s3.yandex.net/qa-automation-engineer/java/track2/cheatsheets/sprint5/polymorphism_cheatsheet.pdf).

### Задание
#### 1
Начинающий разработчик хочет написать программу, которая пополняет баланс телефона.

У него получилось написать её только для целых чисел. Но ведь на счёт можно положить не только целое число рублей, но и дробное — с копейками.

Помоги закончить программу: доработай класс `Account` так, чтобы он мог пополнять баланс и дробными числами.
Без решения
```Java

```

С решением
```Java
public class Praktikum {

    public static void main(String[] args) {
        Account account = new Account(100.65);
        account.add(10);
        account.add(10.10);
        System.out.println(account.getBalance());
    }
}

public class Account {
    private double balance;

    public Account(double balance) {
        this.balance = balance;
    }

    public void add(int money) {
        balance = balance + money;
    }

    public double getBalance() {
        return balance;
    }
}
```
